; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v10 ?v12)
             (pred_10 ?v8 ?v4)
             (pred_6 ?v10 ?v4)
             (pred_11 ?v9 ?v10 )
	     (pred_9 ?v10)
             (pred_5 ?v1)
             (pred_8 ?v8)
             (pred_12 ?v4)
             (pred_7 ?v10)
             (pred_2 ?v8)
             (pred_4 ?v10)
             (pred_3 ))



(:action op_2
:parameters (?v2 ?v3 ?v7 ?v13)
:precondition (and (pred_5 ?v2) (pred_5 ?v3) (pred_8 ?v7) (pred_12 ?v13)
          (pred_1 ?v2 ?v3) (pred_10 ?v7 ?v13)
                   (pred_6 ?v3 ?v13) (pred_9 ?v2) 
                   (pred_7 ?v3) (pred_2 ?v7))
:effect (and  (pred_4 ?v3) (not (pred_7 ?v3))))


(:action op_5
:parameters (?v2 ?v11)
:precondition (and (pred_5 ?v2) (pred_5 ?v11)
               (pred_9 ?v2) (pred_1 ?v2 ?v11) (pred_4 ?v11))
:effect (and (pred_9 ?v11) (not (pred_9 ?v2))))

(:action op_4
:parameters (?v2 ?v7)
:precondition (and (pred_5 ?v2) (pred_8 ?v7) 
                  (pred_9 ?v2) (pred_11 ?v7 ?v2) (pred_3 ))
:effect (and (pred_2 ?v7)
   (not (pred_11 ?v7 ?v2)) (not (pred_3 ))))


(:action op_1
:parameters (?v2 ?v6 ?v5)
:precondition (and (pred_5 ?v2) (pred_8 ?v6) (pred_8 ?v5)
                  (pred_9 ?v2) (pred_2 ?v5) (pred_11 ?v6 ?v2))
:effect (and (pred_2 ?v6) (pred_11 ?v5 ?v2)
        (not (pred_2 ?v5)) (not (pred_11 ?v6 ?v2))))

(:action op_3
:parameters (?v2 ?v7)
:precondition (and (pred_5 ?v2) (pred_8 ?v7) 
                  (pred_9 ?v2) (pred_2 ?v7))
:effect (and (pred_3 ) (pred_11 ?v7 ?v2) (not (pred_2 ?v7)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_22 obj_13 obj_15 obj_28 obj_11 obj_32 obj_07 obj_27 obj_29 obj_31 obj_04 obj_19 obj_09 obj_14 obj_16 obj_26 obj_23 obj_17 obj_18 obj_02 obj_24 obj_06 obj_05 obj_10 obj_20
    obj_21 obj_25 obj_08
    obj_30 obj_03 obj_01 obj_12
    )

    (:init
       (pred_3)

       (pred_5 obj_22)
       (pred_5 obj_13)
       (pred_5 obj_15)
       (pred_5 obj_28)
       (pred_5 obj_11)
       (pred_5 obj_32)
       (pred_5 obj_07)
       (pred_5 obj_27)
       (pred_5 obj_29)
       (pred_5 obj_31)
       (pred_5 obj_04)
       (pred_5 obj_19)
       (pred_5 obj_09)
       (pred_5 obj_14)
       (pred_5 obj_16)
       (pred_5 obj_26)
       (pred_5 obj_23)
       (pred_5 obj_17)
       (pred_5 obj_18)
       (pred_5 obj_02)
       (pred_5 obj_24)
       (pred_5 obj_06)
       (pred_5 obj_05)
       (pred_5 obj_10)
       (pred_5 obj_20)
       (pred_12 obj_21)
       (pred_12 obj_25)
       (pred_12 obj_08)
       (pred_8 obj_30)
       (pred_8 obj_03)
       (pred_8 obj_01)
       (pred_8 obj_12)

       (pred_1 obj_22 obj_32)
       (pred_1 obj_22 obj_13)
       (pred_1 obj_13 obj_07)
       (pred_1 obj_13 obj_15)
       (pred_1 obj_13 obj_22)
       (pred_1 obj_15 obj_27)
       (pred_1 obj_15 obj_28)
       (pred_1 obj_15 obj_13)
       (pred_1 obj_28 obj_29)
       (pred_1 obj_28 obj_11)
       (pred_1 obj_28 obj_15)
       (pred_1 obj_11 obj_31)
       (pred_1 obj_11 obj_28)
       (pred_1 obj_32 obj_04)
       (pred_1 obj_32 obj_07)
       (pred_1 obj_32 obj_22)
       (pred_1 obj_07 obj_19)
       (pred_1 obj_07 obj_27)
       (pred_1 obj_07 obj_13)
       (pred_1 obj_07 obj_32)
       (pred_1 obj_27 obj_09)
       (pred_1 obj_27 obj_29)
       (pred_1 obj_27 obj_15)
       (pred_1 obj_27 obj_07)
       (pred_1 obj_29 obj_14)
       (pred_1 obj_29 obj_31)
       (pred_1 obj_29 obj_28)
       (pred_1 obj_29 obj_27)
       (pred_1 obj_31 obj_16)
       (pred_1 obj_31 obj_11)
       (pred_1 obj_31 obj_29)
       (pred_1 obj_04 obj_26)
       (pred_1 obj_04 obj_19)
       (pred_1 obj_04 obj_32)
       (pred_1 obj_19 obj_23)
       (pred_1 obj_19 obj_09)
       (pred_1 obj_19 obj_07)
       (pred_1 obj_19 obj_04)
       (pred_1 obj_09 obj_17)
       (pred_1 obj_09 obj_14)
       (pred_1 obj_09 obj_27)
       (pred_1 obj_09 obj_19)
       (pred_1 obj_14 obj_18)
       (pred_1 obj_14 obj_16)
       (pred_1 obj_14 obj_29)
       (pred_1 obj_14 obj_09)
       (pred_1 obj_16 obj_02)
       (pred_1 obj_16 obj_31)
       (pred_1 obj_16 obj_14)
       (pred_1 obj_26 obj_24)
       (pred_1 obj_26 obj_23)
       (pred_1 obj_26 obj_04)
       (pred_1 obj_23 obj_06)
       (pred_1 obj_23 obj_17)
       (pred_1 obj_23 obj_19)
       (pred_1 obj_23 obj_26)
       (pred_1 obj_17 obj_05)
       (pred_1 obj_17 obj_18)
       (pred_1 obj_17 obj_09)
       (pred_1 obj_17 obj_23)
       (pred_1 obj_18 obj_10)
       (pred_1 obj_18 obj_02)
       (pred_1 obj_18 obj_14)
       (pred_1 obj_18 obj_17)
       (pred_1 obj_02 obj_20)
       (pred_1 obj_02 obj_16)
       (pred_1 obj_02 obj_18)
       (pred_1 obj_24 obj_06)
       (pred_1 obj_24 obj_26)
       (pred_1 obj_06 obj_05)
       (pred_1 obj_06 obj_23)
       (pred_1 obj_06 obj_24)
       (pred_1 obj_05 obj_10)
       (pred_1 obj_05 obj_17)
       (pred_1 obj_05 obj_06)
       (pred_1 obj_10 obj_20)
       (pred_1 obj_10 obj_18)
       (pred_1 obj_10 obj_05)
       (pred_1 obj_20 obj_02)
       (pred_1 obj_20 obj_10)
       (pred_7 obj_11)
       (pred_7 obj_16)
       (pred_7 obj_23)
       (pred_7 obj_28)
       (pred_6  obj_11 obj_21)
       (pred_6  obj_16 obj_25)
       (pred_6  obj_23 obj_08)
       (pred_6  obj_28 obj_21)
       (pred_4 obj_22)
       (pred_4 obj_13)
       (pred_4 obj_15)
       (pred_4 obj_32)
       (pred_4 obj_07)
       (pred_4 obj_27)
       (pred_4 obj_29)
       (pred_4 obj_31)
       (pred_4 obj_04)
       (pred_4 obj_19)
       (pred_4 obj_09)
       (pred_4 obj_14)
       (pred_4 obj_26)
       (pred_4 obj_17)
       (pred_4 obj_18)
       (pred_4 obj_02)
       (pred_4 obj_24)
       (pred_4 obj_06)
       (pred_4 obj_05)
       (pred_4 obj_10)
       (pred_4 obj_20)

       (pred_10  obj_30 obj_21)
       (pred_10  obj_03 obj_25)
       (pred_10  obj_01 obj_08)
       (pred_10  obj_12 obj_08)
       (pred_11 obj_30 obj_05)
       (pred_11 obj_03 obj_32)
       (pred_11 obj_01 obj_07)
       (pred_11 obj_12 obj_06)
       (pred_9 obj_32)
    )

    (:goal (and
       (pred_11 obj_03 obj_24)
       (pred_11 obj_01 obj_02)
       (pred_11 obj_12 obj_14)
    ))
(:constraints
  (always (not (pred_9 obj_27)))
)
)

; plan
1. (op_4 obj_32 obj_03)
   deleted: (pred_11 obj_03 obj_32) (pred_3)
   added: (pred_2 obj_03)
   goals met: 0 of 3
2. (op_5 obj_32 obj_04)
   deleted: (pred_9 obj_32)
   added: (pred_9 obj_04)
   goals met: 0 of 3
3. (op_5 obj_04 obj_26)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_26)
   goals met: 0 of 3
4. (op_5 obj_26 obj_24)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_24)
   goals met: 0 of 3
5. (op_3 obj_24 obj_03)
   deleted: (pred_2 obj_03)
   added: (pred_3) (pred_11 obj_03 obj_24)
   goals met: 1 of 3
6. (op_5 obj_24 obj_26)
   deleted: (pred_9 obj_24)
   added: (pred_9 obj_26)
   goals met: 1 of 3
7. (op_5 obj_26 obj_04)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_04)
   goals met: 1 of 3
8. (op_5 obj_04 obj_19)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_19)
   goals met: 1 of 3
9. (op_5 obj_19 obj_07)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_07)
   goals met: 1 of 3
10. (op_4 obj_07 obj_01)
   deleted: (pred_11 obj_01 obj_07) (pred_3)
   added: (pred_2 obj_01)
   goals met: 1 of 3
11. (op_5 obj_07 obj_19)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_19)
   goals met: 1 of 3
12. (op_5 obj_19 obj_09)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_09)
   goals met: 1 of 3
13. (op_5 obj_09 obj_14)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_14)
   goals met: 1 of 3
14. (op_5 obj_14 obj_18)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_18)
   goals met: 1 of 3
15. (op_5 obj_18 obj_02)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_02)
   goals met: 1 of 3
16. (op_3 obj_02 obj_01)
   deleted: (pred_2 obj_01)
   added: (pred_3) (pred_11 obj_01 obj_02)
   goals met: 2 of 3
17. (op_5 obj_02 obj_18)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_18)
   goals met: 2 of 3
18. (op_5 obj_18 obj_17)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_17)
   goals met: 2 of 3
19. (op_5 obj_17 obj_05)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_05)
   goals met: 2 of 3
20. (op_5 obj_05 obj_06)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_06)
   goals met: 2 of 3
21. (op_4 obj_06 obj_12)
   deleted: (pred_11 obj_12 obj_06) (pred_3)
   added: (pred_2 obj_12)
   goals met: 2 of 3
22. (op_5 obj_06 obj_05)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_05)
   goals met: 2 of 3
23. (op_5 obj_05 obj_17)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_17)
   goals met: 2 of 3
24. (op_5 obj_17 obj_09)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_09)
   goals met: 2 of 3
25. (op_5 obj_09 obj_14)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_14)
   goals met: 2 of 3
26. (op_3 obj_14 obj_12)
   deleted: (pred_2 obj_12)
   added: (pred_3) (pred_11 obj_12 obj_14)
   goals met: 3 of 3
